# AssemblyMemberDifferentGeometry Properties

---
The AssemblyMemberDifferentGeometry type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from AssemblyMemberDifference)
Top
#### Reference
AssemblyMemberDifferentGeometry Class
Autodesk.Revit.DB Namespace